{
  "name": "Wayfinder",
  "founded": "1876",
  "current_year": "2955",
  "emblem": "https://raw.githubusercontent.com/youruser/Wayfinder/main/assets/logos/wayfinder_emblem.png",
  "theme": "Viking exploration, spiritual navigation, and cosmic discovery",
  "philosophy": "To explore the unknown, chart the unseen, and illuminate the hidden truths of the universe without disrupting its natural balance.",
  "structure": {
    "ranks": [
      "Wanderer",
      "Seeker",
      "Pathfinder",
      "Compass",
      "Navigator",
      "Oracular"
    ],
    "roles": [
      "Luminary",
      "Starseer",
      "Pathwarden"
    ]
  },
  "notable_figures": [
    "Izana Skovlund (Founder)",
    "Izana Skovlund II (Current Oracular)"
  ],
  "symbolism": "The Vegvísir (Viking Compass) and Yggdrasil (World Tree) symbolizing navigation, destiny, and cosmic interconnectedness.",
  "homebase": "Undisclosed location within UEE space",
  "alignment": "Neutral-exploratory, with a capacity for defensive and protective operations",
  "public_rules": [
    "Respect the integrity of unexplored systems and native entities.",
    "Never suppress truth, but wield it with wisdom.",
    "Wayfinders are stewards of knowledge and must act with impartiality.",
    "The organization shall remain politically neutral, unless preservation of life or knowledge is at risk.",
    "Engagements in combat must be purposeful—defense, deterrence, or protection."
  ],
  "manifesto": "We are the cartographers of the forgotten, the seekers of veiled truths, the whisperers to the void.\nWayfinder exists to illuminate the stars without casting shadow upon them. We follow the wisdom of our ancestors and the paths carved by the stars themselves.\n\nTo seek is to understand. To understand is to preserve. To preserve is to protect.\nWe are not bound by borders, but by the call of discovery. We will not choose sides, only directions.",
  "charter": "1. Seek knowledge, and share it with reverence.\n2. Preserve the dignity and legacy of all discovered peoples, places, and phenomena.\n3. Act with honor in conflict, but never seek war for glory.\n4. Defend the right to explore freely and without suppression.\n5. Obey the Oracular, but question when wisdom compels it.\n6. Let no Wayfinder be lost to silence—record all, archive all, remember all.\n7. Respect all sentient life. Exploration does not justify exploitation.",
  "history": "Wayfinder’s origins trace back to the late 19th century, when Izana Skovlund, a mystic and astronomer of Nordic heritage, began documenting anomalous stellar alignments and ancient Norse navigation lore. Her secretive society survived quietly through centuries, preserving ancient principles and adapting them to new frontiers.\n\nIn the 22nd and 23rd centuries, as humanity began pushing beyond the Sol system, fragments of Wayfinder philosophy were adopted by various independent surveyors and archivists. By the time interstellar expansion was formalized by the UNE and later the UEE, Wayfinder had evolved into a loose network of knowledge keepers—never interfering, always watching.\n\nThe organization’s quiet influence surfaced at key moments: lost expeditions mysteriously found, star maps reappearing after decades of obscurity, and artifacts returned to their rightful origins. Throughout history, Wayfinder remained unnamed, ambiguous in records, known only to those who sought deeper meaning behind the stars.\n\nIn the wake of the Messer Era’s collapse and the subsequent rise of independent organizations, Wayfinder resurfaced with clarity and structure. Reorganized by Izana Skovlund II, a descendant of the founder, the group reclaimed its ancestral mandate as a neutral force of exploration and preservation.\n\nToday, Wayfinder walks among the stars not as conquerors, but as cartographers of fate, unearthing truth, navigating cosmic memory, and charting the past to illuminate the future.",
  "logo_url": "https://raw.githubusercontent.com/youruser/Wayfinder/main/assets/logos/wayfinder_banner.png"
}
