{
  "__comment": "This is a fictional captain's log used for player-made adventures. Version is the template version used to create this object and should not be changed unless structure is changed to match most recent template. some descriptions to follow - 'attributes' cover details about the captain, vehicle, organization, and mission. 'narrative' includes a short and long summary of the log, related characters, organizations, vehicles, events, and the log entry itself. 'tags' can be used for categorization or themes.",
  "version": "1.0.0",
  "created_at": 1720033200,
  "modified_at": 1720033200,
  "uuid": "9c52e8c3-b28e-4c63-92a7-0f0f57e6f9ae",
  "type": "event",
  "created_by": "Izana Skovlund II",
  "name": "Gilly Mission Tour & Pyro Sojourn",
  "attributes": {
    "captain_name": "Calliope Joe",
    "vehicle_name": "Nathanial Green",
    "organization": "Phase III",
    "location": ["Stanton", "MicroTech", "Calliope", "Pyro Jump Point", "Pyro Gateway Station", "Stanton Jump Point"],
    "mission_type": ["Travel", "Training"],
    "mission_status": "Completed",
    "location_coordinates": "",
    "date_time": "2955-06-28"
  },
  "narrative": {
    "short_summary": "A multi-part mission aboard the Idris 'Nathanial Green' featuring combat trials, turret training, and a scenic detour to the Pyro system's wormhole jump point.",
    "long_summary": "Once the crew had successfully rendezvoused in orbit, the second chapter of the night began aboard Calliope Joe's Idris, the Nathanial Green. Izana Skovlund II transferred first, leaving Durendal in orbit as a navigational anchor. Guardian was next, securing his Hornet in the bay, followed by Hanze and the newcomer Elflaco, who executed a flawless landing in his Avenger Titan.\n\nThe purpose of this leg was a set of advanced turret drills known as the 'Gilly Missions.' They involved high-threat scenarios including a Hammerhead escort mission and a final showdown against a Polaris-led fleet. Elflaco quickly adapted to turret operations, scoring multiple critical hits and playing a pivotal role in neutralizing the Polaris.\n\nGuardian helmed the Idris for the Polaris engagement, expertly weakening its shields with the main laser, creating openings for coordinated attacks to dismantle its thrusters and ordinance systems. Gilly, ever the phantom handler of these simulations, commended Elflaco’s marksmanship and tenacity.\n\nTo cap off the night’s trials, the crew decided to take a detour to the infamous wormhole jump point to Pyro. The sight of the gate from the bridge left a lasting impression. Once through, they docked briefly at the Pyro Gateway Station. Elflaco disembarked while Calliope Joe and Nomadic Fox handled minor resupplies.\n\nOn the return trip, a jump drive fault pulled the crew unexpectedly back into Pyro. Guardian managed a safe course correction, and Izana took the helm for the final jump, linking up once more with the Durendal. With the ship secured, the crew dispersed for the evening.",
    "related_characters": ["Izana Skovlund II", "Elflaco", "Guardian", "Nomadic Fox", "Calliope Joe", "Hanze"],
    "related_organizations": ["wayfinder", "phase_iii", "those_guys_with_ships"],
    "related_vehicles": [
        {
            "name": "Durendal",
            "model": "Anvil Carrack",
            "commander": "Izana Skovlund II"
        },
        {
            "name": "The Nathanial Green",
            "model": "Idris",
            "commander": "Calliope Joe"
        },
        {
            "name": "",
            "model": "F7A-Mk II Hornet",
            "commander": "Guardian"
        },
        {
            "name": "",
            "model": "Titan Avenger",
            "commander": "Elflaco"
        }
    ],
    "related_events": ["durendal_green_rendezvous"],
    "log_entry": "A multi-part mission aboard the Idris 'Nathanial Green' featuring combat trials, turret training, and a scenic detour to the Pyro system's wormhole jump point."
  },
  "tags": ["Idris", "training", "combat mission", "wormhole", "Pyro jump point", "fleet operations", "crew onboarding"]
}